Revit 2027 API
DirectShape.AddReferencePoint(XYZ) Method
 Adds a reference point to the DirectShape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddReferencePoint(
	XYZ refPoint
)
Public Sub AddReferencePoint (
	refPoint As XYZ
)
public:
void AddReferencePoint(
	XYZ^ refPoint
)
member AddReferencePoint :
        refPoint : XYZ -> unit
Parameters
refPoint XYZ
 The coordinates of the new reference point.
Exceptions
Exception | Condition
ArgumentException |  The input point lies outside of Revit design limits.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShape Class
AddReferencePoint Overload
Autodesk.Revit.DB Namespace